%氢原子概率密度由径向决定的函数
function Wr=fun(n,l,z,x)
nl=n+l;                                %最大量子数
ll1=2*l+1;                             %磁量子数的个数
nl1=n-l-1;                             %剩余量子数
c=-factorial(nl)^2/factorial(ll1)/factorial(nl1);%零次项系数
%----------------------------------------------------------
p=c;                                   %系数向量的初值
for i=1:nl1                            %从1开始循环
    c=-c*(nl1+1-i)/(ll1+i)/i;          %计算拉盖尔多项式系数
    p=[c,p];                           %按降序排列连接系数向量
end                                    %结束循环
la=polyval(p,x);                       %连带拉盖尔多项式函数值
%----------------------------------------------------------
% la=c;                                  %初值
% for i=1:nl1                            %从1开始循环
%     c=-c*(nl1+1-i)/(ll1+i)/i;          %计算拉盖尔多项式系数
%     la=la+c*x.^i;                      %累加拉盖尔多项式之值
% end                                    %结束循环
%----------------------------------------------------------
mm=4*z^3*factorial(n-l-1)/n^4/factorial(n+l)^3;%归一化系数的平方
Wr=mm*exp(-x).*x.^(2*l).*la.^2;        %与径向有关的概率密度

